Revit 2027 API
SchemaCommon.VersionGUID Property
 The property labeled "VersionGUID" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string VersionGUID { get; }
Public Shared ReadOnly Property VersionGUID As String
	Get
public:
static property String^ VersionGUID {
	String^ get ();
}
static member VersionGUID : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString" and will contain a uuid.
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace